shorepine/tulipcc/ports/esp32/components/bw_esp_lcd/src/esp_lcd_rgb_panel.c
static esp_err_t lcd_rgb_panel_select_periph_clock(esp_rgb_panel_t *panel, lcd_clock_source_t clk_src)
{
    esp_err_t ret = ESP_OK;
    // force to use integer division, as fractional division might lead to clock jitter
    lcd_ll_set_group_clock_src(panel->hal.dev, clk_src, LCD_PERIPH_CLOCK_PRE_SCALE, 0, 0);
    switch (clk_src) {
    case LCD_CLK_SRC_PLL160M:
        panel->resolution_hz = 160000000 / LCD_PERIPH_CLOCK_PRE_SCALE;
#if CONFIG_PM_ENABLE
        ret = esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "rgb_panel", &panel->pm_lock);
        ESP_RETURN_ON_ERROR(ret, TAG, "create ESP_PM_APB_FREQ_MAX lock failed");
        // hold the lock during the whole lifecycle of RGB panel
        esp_pm_lock_acquire(panel->pm_lock);
        ESP_LOGD(TAG, "installed ESP_PM_APB_FREQ_MAX lock and hold the lock during the whole panel lifecycle");
#endif
        break;
    case LCD_CLK_SRC_XTAL:
        panel->resolution_hz = rtc_clk_xtal_freq_get() * 1000000 / LCD_PERIPH_CLOCK_PRE_SCALE;
        break;
    default:
        ESP_RETURN_ON_FALSE(false, ESP_ERR_NOT_SUPPORTED, TAG,  "unsupported clock source: %d", clk_src);
        break;
    }
    return ret;
}

/*
static esp_err_t lcd_rgb_panel_create_circular_trans_link(esp_rgb_panel_t *panel)
{
    esp_err_t ret = ESP_OK;
    // chain DMA descriptors
    for (int i = 0; i < panel->num_dma_nodes; i++) {
        panel->dma_nodes[i].dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_CPU;
        panel->dma_nodes[i].next = &panel->dma_nodes[i + 1];
    }
    // circular DMA chain
    panel->dma_nodes[panel->num_dma_nodes - 1].next =NULL;

    // mount the frame buffer to the DMA descriptors
    // len is ignored
    lcd_com_mount_circular_dma_data(panel->dma_nodes, panel->fb, 0);
    // alloc DMA channel and connect to LCD peripheral
    gdma_channel_alloc_config_t dma_chan_config = {
        .direction = GDMA_CHANNEL_DIRECTION_TX,
    };
    ret = gdma_new_channel(&dma_chan_config, &panel->dma_chan);
    ESP_GOTO_ON_ERROR(ret, err, TAG, "alloc DMA channel failed");
    gdma_connect(panel->dma_chan, GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_LCD, 0));
    gdma_transfer_ability_t ability = {
        .psram_trans_align = panel->psram_trans_align,
        .sram_trans_align = panel->sram_trans_align,
    };
    gdma_set_transfer_ability(panel->dma_chan, &ability);
    // the start of DMA should be prior to the start of LCD engine
    gdma_start(panel->dma_chan, (intptr_t)panel->dma_nodes);

err:
    return ret;
}

*/
static IRAM_ATTR bool lcd_rgb_panel_fill_bounce_buffer(esp_rgb_panel_t *panel, uint8_t *buffer)
{
    bool need_yield = false;
    uint8_t bpp = (panel->data_width / 8);
    if (panel->on_bounce_empty) {
        //We don't have a framebuffer here; we need to call a callback to refill the bounce buffer
        //for us.
        need_yield=panel->on_bounce_empty((void*)buffer, panel->bounce_pos_px, 
                    panel->bounce_buffer_size_bytes, panel->bounce_buffer_cb_user_ctx);
    } else {
        //We do have a framebuffer; copy from there.
        memcpy(buffer, &panel->fb[panel->bounce_pos_px*bpp], panel->bounce_buffer_size_bytes);
        //We don't need the bytes we copied from psram anymore.
        //Make sure that if anything happened to have changed (because the line already was in cache) we write
        //the data back
        Cache_WriteBack_Addr((uint32_t)&panel->fb[panel->bounce_pos_px*bpp], panel->bounce_buffer_size_bytes);
        //Invalidate the data. Note: possible race: perhaps something can squeeze a byte between this and the
        //writeback, in which case that data gets discarded. Probably need to warn people to only write to the
        //fb on one core... which you probably want to do anyway given the bw limits of the bus.
        Cache_Invalidate_Addr((uint32_t)&panel->fb[panel->bounce_pos_px*bpp], panel->bounce_buffer_size_bytes);
    }
    panel->bounce_pos_px+=(panel->bounce_buffer_size_bytes/bpp);
    //If the bounce pos is larger than the framebuffer size, wrap around so the next isr starts pre-loading
    //the next frame.
    if (panel->bounce_pos_px >= panel->fb_size/bpp) {
        panel->bounce_pos_px=0;
    }
    if (!panel->on_bounce_empty) {
        //Preload the next bit of buffer into psram.
        Cache_Start_DCache_Preload((uint32_t)&panel->fb[panel->bounce_pos_px*bpp],
                    panel->bounce_buffer_size_bytes, 0);
    }
    return need_yield;
}

static IRAM_ATTR bool lcd_rgb_panel_eof_handler(gdma_channel_handle_t dma_chan, gdma_event_data_t *event_data, void *user_data)
{
    esp_rgb_panel_t *panel = (esp_rgb_panel_t*)user_data;
    dma_descriptor_t *desc = (dma_descriptor_t*)event_data->tx_eof_desc_addr;
    //Figure out which bounce buffer to write to.
    //Note: what we receive is the *last* descriptor of this bounce buffer. 
    if (desc==&panel->dma_nodes[panel->num_dma_nodes - 1]) {
        return lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[1]);
    } else {
        return lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[0]);
    }
    return false; //never reached
}

static esp_err_t lcd_rgb_panel_create_trans_link(esp_rgb_panel_t *panel)
{
    esp_err_t ret = ESP_OK;
    if (panel->bounce_buffer_size_bytes == 0) {
        // Create DMA descriptors for main framebuffer.
        // chain DMA descriptors
        for (int i = 0; i < panel->num_dma_nodes; i++) {
            panel->dma_nodes[i].dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_CPU;
            panel->dma_nodes[i].next = &panel->dma_nodes[i + 1];
        }
        //loop end back to start
        panel->dma_nodes[panel->num_dma_nodes - 1].next = &panel->dma_nodes[0];
        // mount the frame buffer to the DMA descriptors
        lcd_com_mount_dma_data(panel->dma_nodes, panel->fb, panel->fb_size);
    } else {
        //Create DMA descriptors for bounce buffers
        for (int i = 0; i < panel->num_dma_nodes; i++) {
            panel->dma_nodes[i].dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_CPU;
            panel->dma_nodes[i].next = &panel->dma_nodes[i + 1];
        }
        //loop end back to start
        panel->dma_nodes[panel->num_dma_nodes - 1].next = &panel->dma_nodes[0];
        //set eof on end of 1st and 2nd bounce buffer
        panel->dma_nodes[(panel->num_dma_nodes/2) - 1].dw0.suc_eof=1;
        panel->dma_nodes[panel->num_dma_nodes - 1].dw0.suc_eof=1;
        // mount the bounce buffers to the DMA descriptors
        lcd_com_mount_dma_data(&panel->dma_nodes[0], panel->bounce_buffer[0], panel->bounce_buffer_size_bytes);
        lcd_com_mount_dma_data(&panel->dma_nodes[(panel->num_dma_nodes/2)], panel->bounce_buffer[1], panel->bounce_buffer_size_bytes);
    }
    // alloc DMA channel and connect to LCD peripheral
    gdma_channel_alloc_config_t dma_chan_config = {
        .direction = GDMA_CHANNEL_DIRECTION_TX,
    };
    ret = gdma_new_channel(&dma_chan_config, &panel->dma_chan);
    ESP_GOTO_ON_ERROR(ret, err, TAG, "alloc DMA channel failed");
    gdma_connect(panel->dma_chan, GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_LCD, 0));
    gdma_transfer_ability_t ability = {
        .psram_trans_align = panel->psram_trans_align,
        .sram_trans_align = panel->sram_trans_align,
    };
    gdma_set_transfer_ability(panel->dma_chan, &ability);
    if (panel->bounce_buffer_size_bytes != 0) {
        // register callback to re-fill bounce buffers once they're fully sent
        gdma_tx_event_callbacks_t cbs={0};
        cbs.on_trans_eof = lcd_rgb_panel_eof_handler;
        gdma_register_tx_event_callbacks(panel->dma_chan, &cbs, panel);
    }
    // the start of DMA should be prior to the start of LCD engine
    gdma_start(panel->dma_chan, (intptr_t)panel->dma_nodes);

err:
    return ret;
}
extern int32_t desync;

static void lcd_rgb_panel_restart_transmission(esp_rgb_panel_t *panel)
{
    if (panel->bounce_buffer_size_bytes != 0) {
        if(panel->data_width == 16) {
            //Catch de-synced framebuffer and reset if needed.
            if (panel->bounce_pos_px > (panel->bounce_buffer_size_bytes)) { desync++; panel->bounce_pos_px=0; }
            //Pre-fill bounce buffer 0, if the EOF ISR didn't do that already
            if (panel->bounce_pos_px < panel->bounce_buffer_size_bytes/2) {
                lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[0]);
            }
        } else {
            //Catch de-synced framebuffer and reset if needed.
            // TODO, not sure how but we should do something other than mis-align the top of the screen when this happens
            
            if (panel->bounce_pos_px > (panel->bounce_buffer_size_bytes*2)) { desync++; panel->bounce_pos_px=0; }
            //Pre-fill bounce buffer 0, if the EOF ISR didn't do that already
            if (panel->bounce_pos_px < panel->bounce_buffer_size_bytes/2) {
                lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[0]);
            }            
        }
    }
    gdma_reset(panel->dma_chan);
    lcd_ll_fifo_reset(panel->hal.dev);
    gdma_start(panel->dma_chan, (intptr_t)panel->dma_nodes);

    if (panel->bounce_buffer_size_bytes != 0) {
        //Fill 2nd bounce buffer while 1st is being sent out, if needed.
        if(panel->data_width == 16) {
            if (panel->bounce_pos_px < (panel->bounce_buffer_size_bytes)) {
                lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[0]);
            }
        } else {
            if (panel->bounce_pos_px < (panel->bounce_buffer_size_bytes)) {
                lcd_rgb_panel_fill_bounce_buffer(panel, panel->bounce_buffer[0]);
            }            
        }
    }
}


