shorepine/tulipcc/ports/esp32/components/bw_esp_lcd/src/esp_lcd_rgb_panel.c
static void lcd_rgb_panel_start_transmission(esp_rgb_panel_t *rgb_panel)
{
    // reset FIFO of DMA and LCD, incase there remains old frame data
    gdma_reset(rgb_panel->dma_chan);
    lcd_ll_stop(rgb_panel->hal.dev);
    lcd_ll_fifo_reset(rgb_panel->hal.dev);

    //pre-fill bounce buffers if needed
    if (rgb_panel->bounce_buffer_size_bytes != 0) {
        rgb_panel->bounce_pos_px = 0;
        lcd_rgb_panel_fill_bounce_buffer(rgb_panel, rgb_panel->bounce_buffer[0]);
        lcd_rgb_panel_fill_bounce_buffer(rgb_panel, rgb_panel->bounce_buffer[1]);   
    }

    gdma_start(rgb_panel->dma_chan, (intptr_t)rgb_panel->dma_nodes);
    // delay 1us is sufficient for DMA to pass data to LCD FIFO
    // in fact, this is only needed when LCD pixel clock is set too high
    esp_rom_delay_us(1);
    lcd_ll_enable_auto_next_frame(rgb_panel->hal.dev, rgb_panel->flags.stream_mode);

    // start LCD engine
    lcd_ll_start(rgb_panel->hal.dev);
}
IRAM_ATTR static void lcd_default_isr_handler(void *args)
{
    esp_rgb_panel_t *rgb_panel = (esp_rgb_panel_t *)args;
    bool need_yield = false;

    uint32_t intr_status = lcd_ll_get_interrupt_status(rgb_panel->hal.dev);
    lcd_ll_clear_interrupt_status(rgb_panel->hal.dev, intr_status);
    if (intr_status & LCD_LL_EVENT_VSYNC_END) {
        // call user registered callback
        if (rgb_panel->on_frame_trans_done) {
            if (rgb_panel->on_frame_trans_done(&rgb_panel->base, NULL, rgb_panel->user_ctx)) {
                need_yield = true;
            }
        }
        
        // look here 

        if (rgb_panel->flags.stream_mode) {
            // In some cases, there can be a GDMA bandwidth issue that de-syncs the LCD and GDMA 
            // states, as in the GDMA provides a pixel earlier or later than what the LCD peripheral
            // wants to output. To compensate for that, we reset the DMA in the VBlank because we 
            // know the LCD will be requesting pixel (0,0) next.
            // ToDo: Only reset DMA when this interrupt is not late!
            lcd_rgb_panel_restart_transmission(rgb_panel);
        }
    }

    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}
